In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\dell\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\dell\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
txt_data = pd.read_table('BF.txt')

In [4]:
txt_data.head()

,2282318,Pouéné,Pouene,Unnamed: 3,9.72908,-2.7866,H,STM,BF,Unnamed: 9,00,Unnamed: 11,Unnamed: 12,Unnamed: 13,0,Unnamed: 15,226,Africa/Abidjan,2023-11-07
0,2285251,Léraba Occidentale,Leraba Occidentale,"Badini,La Leraba Occidentale,Leraba,Leraba Occ...",10.28333,-5.11667,H,STM,BF,CI,00,NaN,NaN,NaN,0,NaN,283,Africa/Abidjan,2023-11-07
1,2287216,Kéléouoro,Keleouoro,"Keleouoro,Keleworo,Kéléouoro,Kéléworo",9.80748,-4.05023,H,STM,BF,"BF,CI",00,NaN,NaN,NaN,0,NaN,261,Africa/Abidjan,2023-11-07
2,2294066,White Volta,White Volta,"Nakambe,Nakambé,Nakanbe,Nakanbé,Volta Blanche,...",8.70194,-0.99056,H,STM,BF,GH,00,NaN,NaN,NaN,0,NaN,75,Africa/Accra,2023-11-08
3,2298457,Issana Bouga,Issana Bouga,"Issana Bouga,Lanyung,Lanyunga",10.91667,-1.18333,H,STM,BF,NaN,00,NaN,NaN,NaN,0,NaN,178,Africa/Accra,2023-11-08
4,2353158,Zyonguen,Zyonguen,NaN,12.36667,-0.45000,P,PPL,BF,NaN,04,NaN,NaN,NaN,0,NaN,293,Africa/Ouagadougou,2012-06-05

In [5]:
txt_data[['2282318', 'Pouene', '9.72908', '-2.7866']].head()

   2282318              Pouene   9.72908  -2.7866
0  2285251  Leraba Occidentale  10.28333 -5.11667
1  2287216           Keleouoro   9.80748 -4.05023
2  2294066         White Volta   8.70194 -0.99056
3  2298457        Issana Bouga  10.91667 -1.18333
4  2353158            Zyonguen  12.36667 -0.45000

In [6]:
txt_data = txt_data.rename(columns={
    '2282318': 'ID',
    'Pouene': 'location_name',
    '9.72908': 'lat',
    '-2.7866': 'long'
})

In [7]:
txt_data[['ID', 'location_name', 'lat', 'long']].head()

        ID       location_name       lat     long
0  2285251  Leraba Occidentale  10.28333 -5.11667
1  2287216           Keleouoro   9.80748 -4.05023
2  2294066         White Volta   8.70194 -0.99056
3  2298457        Issana Bouga  10.91667 -1.18333
4  2353158            Zyonguen  12.36667 -0.45000

In [8]:
df_extract = txt_data[['ID', 'location_name', 'lat', 'long']]
df_extract.to_csv('burkina_location.csv', index=False)

In [9]:
dataset = pd.read_csv('burkina_location.csv')

In [10]:
dataset.head()

        ID       location_name       lat     long
0  2285251  Leraba Occidentale  10.28333 -5.11667
1  2287216           Keleouoro   9.80748 -4.05023
2  2294066         White Volta   8.70194 -0.99056
3  2298457        Issana Bouga  10.91667 -1.18333
4  2353158            Zyonguen  12.36667 -0.45000

In [11]:
filtered_data = dataset[dataset['location_name'].str.contains('gounghin', case=False, na=False)]

In [12]:
filtered_data.head()

             ID       location_name       lat     long
152     2353306            Gounghin  12.06677 -1.42134
7268    2360473            Gounghin  12.62488 -1.36398
10259   2570204            Gounghin  12.31436 -1.37900
10745  10342749            Gounghin  12.06667 -0.15000
10758  10629032  BICIAB // Gounghin  12.35921 -1.54273

In [13]:
df_extract = dataset[dataset['location_name'].str.contains('gounghin', case=False, na=False)]
df_extract.to_csv('gounghin.csv', index=False)

In [14]:
filtered_data = dataset[dataset['location_name'].str[0].str.upper().between('A', 'P')] 
filtered_data = filtered_data.sort_values('location_name')

In [15]:
filtered_data.head()

             ID location_name       lat     long
10647   6913771        Abanda  15.06808 -0.59805
10030   2363251        Abanga  13.32429  0.31151
11092  11980339        Abassi  12.27728 -1.13662
10600   6874881         Abaye  13.44080 -3.90190
10029   2363250      Aberekui  12.50000 -3.41667

In [16]:
df_extract = dataset[dataset['location_name'].str[0].str.upper().between('A', 'P')]
df_extract = filtered_data.sort_values('location_name')
df_extract.to_csv('A_to_P.csv', index=False)

In [17]:
filtered_data = dataset[dataset['long'] == dataset['long'].min()]

In [18]:
filtered_data.head()

           ID location_name       lat     long
4219  2357400      Banifing  12.01147 -5.65968

In [19]:
filtered_data = dataset[
    (dataset['lat'] >= 11) & 
    (dataset['long'] <= 0.5)
]

In [20]:
filtered_data.head()

        ID location_name       lat     long
4  2353158      Zyonguen  12.36667 -0.45000
5  2353159     Zyiliwele  12.38333 -2.73333
6  2353160        Zyanko  12.78333 -0.41667
7  2353161         Zouta  13.14908 -1.28197
8  2353162     Zourtenga  12.95741 -1.28745

In [21]:
df_extract = dataset[
    (dataset['lat'] >= 11) & 
    (dataset['long'] <= 0.5)
]
df_extract.to_csv('interval.csv', index=False)